Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: It won't have any effect until Logisim is restarted.
ru_ru: Это не будет иметь никакого эффекта, пока Logisim не будет перезапущен.

source: We wish to avoid the danger that redistributors of a free program will individually obtain patent licenses, in effect making the program proprietary.
ru_ru: Мы хотим избежать опасности, что повторные распространители свободной программы самостоятельно получат патенты, делая программу таким образом частной собственностью.

source: // We'll have width, label, and label font attributes.
ru_ru: // У нас будут атрибуты ширина, метка и шрифт метки.

source: These sections are written so that they can be read "cover to cover" to learn about all of the most important features of Logisim.
ru_ru: Эти разделы написаны так, что их можно читать "от корки до корки" чтобы узнать обо всех наиболее важных возможностях Logisim.

source: Hz (509 ticks in 712 milliseconds)
ru_ru: Гц (509 тактов за 712 миллисекунд)

source: Such new versions will be similar in spirit to the present version, but may differ in detail to address new problems or concerns.
ru_ru: Такие новые версии будут сходны по духу с настоящей версией, но могут отличаться в деталях, направленных на новые проблемы или обстоятельства.

source: an offer, in accord with Subsection b above.) The source code for a work means the preferred form of the work for making modifications to it.
ru_ru: предложением в соответствии с Пунктом b) выше.) Исходный код для призведения означает его вид, предпочтительный для выполнения в нем модификаций.

source: South edge (input, bit width is quotient of Data Bits and Output Bits, rounded up)
ru_ru: Южный край (вход, разрядность равна отношению атрибутов Биты данных и Выходные биты, округлённому вверх)

source: Black: The wire is carrying a multi-bit value.
ru_ru: Чёрный: Провод несёт многобитное значение.

source: The RAM and ROM components are two of the more useful components in Logisim's built-in libraries.
ru_ru: Компоненты ОЗУ и ПЗУ - два из наиболее полезных компонентов во встроенной библиотеке Logisim.

source: By default, Logisim ignores such inputs, allowing a gate to work over fewer inputs than it was designed for.
ru_ru: По умолчанию Logisim игнорирует такие входы, что позволяет логическим элементам работать с меньшим количеством входов, чем они рассчитаны.

source: The color with which to draw the display segments and decimal point when they are off.
ru_ru: Цвет, используемый для отображения сегментов и десятичной точки, когда они выключены.

source: The category of combinational circuits is the simpler of the two.
ru_ru: Категория комбинационных схем является более простой из них.

source: Graphics acceleration: One Logisim user observed that adding -Dsun.java2d.d3d=True to the command line seemed to improve Logisim's graphics performance by telling it to use hardware graphics acceleration.
ru_ru: Ускорение графики: один из пользователей Logisim отметил, что добавление -Dsun.java2d.d3d=True к командной строке кажется улучшает производительность графики Logisim, заставляя его использовать аппаратное ускорение графики.

source: The precise behavior of the Poke Tool varies depending on which component is clicked; this behavior is documented in the `Poke Tool Behavior' section of each individual component.
ru_ru: Точное поведение Инструмента Нажатие варьируется в зависимости от того, на каком компоненте он применён; это поведение описано в разделе "Поведение Инструмента Нажатие" каждого отдельного компонента.

source: Supports different ways of depicting the splitter in the circuit.
ru_ru: Позволяет изображать разветвитель на схеме разными способами.

source: Next: The Window and Help menus.
ru_ru: Далее: Меню Окно и Справка.

source: * StdAttr attributes when appropriate: A user can then select several
ru_ru: * атрибуты StdAttr, когда это уместно: пользователь может выбрать несколько

source: Double-click, press the Enter key, or click the starting vertex to complete the shape.
ru_ru: Дважды щёлкните, нажмите клавишу Enter, или щёлкните на начальной вершине для завершения фигуры.

source: You can navigate through memory using the scroll bar or using the keyboard (the arrow keys, home, end, page up, and page down).
ru_ru: Вы можете перемещаться по памяти с помощью полосы прокрутки или с помощью клавиатуры (клавиши со стрелками, Home, End, Page Up, и Page Down).

source: The second of the two values to be compared.
ru_ru: Второе значение для сравнения.

source: * input/output/both, and finally the expected bit width for the port.
ru_ru: * входом/выходом/обоими, и наконец ожидаемую разрядность для порта.

source: If there are more than four inputs, the Karnaugh map will not appear; but the minimized expression will still be computed.
ru_ru: Если выходов более четырёх, то карта Карно не появится, но минимизированное выражение всё равно будет вычислено.

source: Thus, if a circuit containing a ROM component is used twice, then both ROM components will hold the same values.
ru_ru: Таким образом, если схема, содержащая компонент ПЗУ, используется два раза, то оба компонента будут хранить одинаковые значения.

source: Add or edit text.
ru_ru: Добавлять и редактировать текст.

source: // up creating a CounterData object if one doesn't already exist.
ru_ru: // созданием объекта CounterData, если ещё ни одного не существует.

source: In fact, they are non-directional: They can send values one way at one time and another way later, and they can even do both at the same time, as in the below example where a value travels eastward through the two splitters, then is routed back westward through them again, and then back eastward where it finally reaches its output.
ru_ru: На самом деле они не имеют направления: они могут пересылать значение один раз в одном направлении, а позже - в другом; они даже могут делать и то и другое одновременно, как показано в примере ниже, где значение проходит на восток через два разветвителя, затем направляется обратно через них на запад, и затем обратно на восток, где оно наконец достигает выхода.

source: These are spots where wires can be attached.
ru_ru: Это места, где могут быть прикреплены провода.

source: Gray: The wire's bit width is unknown.
ru_ru: Серый: Разрядность провода неизвестна.

source: *South edge, other pins (output, bit width matches Data Bits attribute)
ru_ru: *Южный край, остальные контакты (выход, разрядность соответствует атрибуту Биты данных)

source: To enter the subcircuit's state, you can use any of three different techniques.
ru_ru: Для входа в состояние подсхемы вы можете использовать любой из трёх различных методов.

source: Templates can also be useful in the classroom setting when the instructor opens a file submitted by a student who has configured the environment significantly.
ru_ru: Шаблоны также могут быть полезны как общие для класса настройки, когда преподаватель открывает файл, представленный учащимся, который значительно настроил среду.

source: For example, 11001011 rotated right twice is 11110010.
ru_ru: Например, 11001011 циклически сдвинутое вправо на два - это 11110010.

source: In order from most damning to least damning, the shortcomings of Logisim's propagation technique include:
ru_ru: В порядке от более тяжёлых к менее тяжёлым, недостатки метода просчёта Logisim следующие:

source: // state can be manipulated using the Poke Tool.
ru_ru: // экземпляра можно было управлять с помощью Инструмента Нажатие.

source: Dragging the mouse starting at a location not contained within any components drops all components from the current selection and initiates a rectangular selection.
ru_ru: Перетаскивание мыши, начинающееся с точки, не находящейся внутри какого-либо компонента, обнуляет текущее выделение и инициирует прямоугольное выделение.

source: For single-bit wires, you can see at a glance what value the wire carries because Logisim colors the wire light or dark green depending the value.
ru_ru: Для однобитных проводов вы сразу можете увидеть, какое значение передаёт провод, потому что Logisim окрашивает провод в светло- или тёмно- зелёный в зависимости от значения.

source: Now we've created two different files.
ru_ru: Теперь мы создали два разных файла.

source: // another thread, and invoking setPort directly could interfere with
ru_ru: // другом потоке, и непосредственный вызов setPort может помешать

source: The negation of the input.
ru_ru: Отрицание для входного значения.

source: BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.
ru_ru: ПОСКОЛЬКУ ПРОГРАММА ПРЕДОСТАВЛЯЕТСЯ БЕСПЛАТНО, НА ПРОГРАММУ НЕТ ГАРАНТИЙ В ТОЙ МЕРЕ, КАКАЯ ДОПУСТИМА ПРИМЕНИМЫМ ЗАКОНОМ.

source: Indicates which bit to search for — the lowest-order 0, the highest-order 0, the lowest-order 1, or the highest-order 1.
ru_ru: Указывает, какой бит искать - младший 0, старший 0, младший 1, или старший 1.

source: The Russian translation was introduced with Logisim 2.4.0 and remains current.
ru_ru: Русский перевод был представлен в Logisim 2.4.0 и остаётся актуальным.

source: When the component is selected or being added, the digits 0 through 9 alter the Bit Width In attribute and Alt-0 through Alt-9 alter its Bit Width Out attribute.
ru_ru: Когда компонент выбран, или уже добавлен, клавиши от 0 до 9 меняют атрибут Разрядность входа, а комбинации от Alt-0 до Alt-9 меняют атрибут Разрядность выхода.

source: There will be as many of these as specified in the Number of Inputs attribute.
ru_ru: Их будет столько, сколько указано в атрибуте Количество входов.

source: The Expression tab allows you to view and edit the current expression associated with each output variable.
ru_ru: Вкладка Выражение позволяет вам просматривать и редактировать текущее выражение, связанное с каждой выходной переменной.

source: When the component is selected or being added, the digits '0' through '9' alter its Address Bit Width attribute and Alt-0 through Alt-9 alter its Data Bit Width attribute.
ru_ru: Когда компонент выбран, или уже добавлен, клавиши от 0 до 9 меняют его атрибут Разрядность адреса, а комбинации от Alt-0 до Alt-9 меняют его атрибут Разрядность данных.

source: LED Matrix
ru_ru: Светодиодная матрица

source: One example of this is the Pin tool, whose icon faces the same way as its Facing attribute says.
ru_ru: Одним из таких примеров является инструмент Контакт, чей значок расположен так, как указано в его атрибуте Направление.

source: Here, we're choosing the component to
ru_ru: Здесь мы задаём компонент

source: Previous to insertion, the selected point is drawn as a diamond.
ru_ru: Перед вставкой выделенная точка отображается в виде ромба.

source: Given an input of several bits, this will divide it into several equal-sized groups (starting from the lowest-order bit) and output the group selected by the select input.
ru_ru: Принимая на входе несколько битов, этот компонент будет разделять их на несколько одинаковых по размеру групп (начиная с бита с самым низким порядком) и пускать на выход группу, определённую выбирающим входом.

source: You can develop a set of circuits in a single project (as described in the Subcircuits section of this guide) and then use that set of circuits as a library for other projects.
ru_ru: Вы можете разработать набор схем в одном проекте (как описано в разделе Подсхемы данного руководства), а затем использовать этот набор схем в виде библиотеки для других проектов.

source: As an extreme example, I have a friend who works for a major chip manufacturer, and his job is to worry about "bubbles" in chips' nanometer-wide wires growing and leading to random disconnection.
ru_ru: Как крайний случай, у меня есть друг, который работает на крупного производителя чипов, и его работа - следить за "пузырьками" в проводах нанометрового масштаба, растущими и проводящими к случайным разрывам.

source: The counter decrements.
ru_ru: Значение счётчика уменьшается на единицу.

source: The bit width of the value emitted by the component.
ru_ru: Разрядность значения, выдаваемого компонентом.

source: This component multiplies two values coming in via the west inputs and outputs the product on the east output.
ru_ru: Этот компонент перемножает два значения, поступающие на западные входы и выдаёт произведение на восточный выход.

source: That is, changes to the circuit will not be reflected in the window, nor will changes to the Boolean expressions and/or truth table in the window be reflected in the circuit.
ru_ru: То есть, изменения схемы не будут отражены в окне, и изменения в логических выражениях и/или таблице истинности, сделанные в окне, не будут отражены в схеме.

source: The anchor also identifies the appearance's facing, as indicated by the direction the anchor's line points from its circle.
ru_ru: Якорь также задаёт направление внешнего вида; оно указывается направлением линии анха, в котором она выходит из круга.

source: South edge, rightmost pin (output, bit width 7)
ru_ru: Южный край, правый контакт (выход, разрядность равна 7)

source: Logisim is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
ru_ru: Logisim является свободным программным обеспечением; вы можете его распространять и/или модифицировать его в соответствии с условиями Универсальной Общественной Лицензии GNU, опубликованной Фондом свободного программного обеспечения; версии 2 лицензии, либо (по вашему выбору) любой более поздней версии.

source: Press the mouse button there and drag as far as you want the wire to go.
ru_ru: Нажмите здесь кнопку мыши и перетащите туда, где вы хотите, чтобы был провод.

source: The File tab allows you to specify a file into which the log should be placed.
ru_ru: Вкладка Файл позволяет вам выбрать файл, в который будет помещён журнал.

source: A transistor has two inputs, called gate and source, and one output, called drain.
ru_ru: Транзистор имеет два входа, называемые затвор и исток, и выход, называемый сток.

source: Type
ru_ru: Тип

source: Specifies whether the unselected outputs should be floating (Yes) or zero (No).
ru_ru: Определяет, должны значения на невыбранных выходах быть плавающими (Да) или нулями (Нет).

source: Activities other than copying, distribution and modification are not covered by this License; they are outside its scope.
ru_ru: Виды деятельности, не являющиеся копированием, распространением или модификацией не охватываются этой Лицензией; они за пределами ее влияния.

source: I find it useful to think of a multiplexer as analogous to a railroad switch, controlled by the select input.
ru_ru: Я считаю полезным думать о мультиплексоре как об аналоге железнодорожной стрелки, управляемой выбирающим входом.

source: This pin is available only when the Extension Type attribute is Input.
ru_ru: Этот контакт доступен только когда атрибут Тип расширения - Вход.

source: In particular, the value changes when the clock input, marked by a triangle on each flip-flop, rises from 0 to 1 (or otherwise as configured); on this rising edge, the value changes according to the table below.
ru_ru: В частности, значение меняется, когда значение на тактовом входе, отмеченном треугольником на каждом триггере, меняется с 0 на 1 (или наоборот, если так настроено); в момент этого перехода значение меняется в соответствии с таблицей ниже.

source: If you want a bare-bones configuration, you might choose "Empty template." But if you want to designate another file to use as the template, select a template via the Select... button, and then choose the "Custom template" option.
ru_ru: Если вы хотите скелетную конфигурацию, вы можете выбрать "Пустой шаблон". Но если вы хотите назначить другой файл для использования в качестве шаблона, выберите шаблон через кнопку Выбрать..., а затем укажите вариант "Специальный шаблон".

source: A on west edge (input, bit width matches Address Bit Width attribute)
ru_ru: A на западном крае (вход, разрядность соответствует атрибуту Разрядность адреса)

source: Replace accented characters: Some platforms have poor support for characters (such as ñ or ö) that do not appear in the 7-bit ASCII character set.
ru_ru: Заменять специфичные символы: некоторые платформы имеют плохую поддержку для символов (например ñ или ö), которых нет в 7-битном наборе символов ASCII.

source: Input/Output Library
ru_ru: Библиотека Ввод/вывод

source: Logisim will silently correct attempts to create wires that slightly overshoot the stub's end.
ru_ru: Logisim будет без напоминаний поправлять попытки создания проводов, слегка перекрывающих отрезки.

source: (Logisim uses the Quine-McCluskey algorithm to compute the minimized expression.
ru_ru: (Logisim использует метод Куайна — Мак-Класки для вычисления минимизированного выражения.

source: Opens the Project Options window.
ru_ru: Открывает окно Параметры проекта.

source: (This may also be handy if you are left-handed.) Each combination of a mouse button and a modifier key (any subset of shift, control, and alt) can be mapped to a different tool.
ru_ru: (Это также может быть полезно, если вы левша.) Каждая комбинация кнопки мыши и клавиши-модификатора (любая комбинация Shift, Control и Alt) может быть привязана к определённому инструменту.

source: Several pieces of Logisim come from others' packages that Logisim uses; several of these pieces are distributed as part of Logisim.
ru_ru: Некоторые части Logisim пришли из других пакетов, которые Logisim использует; некоторые из этих частей распространяются как часть Logisim.

source: Data: These values are loaded into all stages when the clock is triggered while the load input is 1.
ru_ru: Данные: эти значения загружаются во все ступени при срабатывании тактового входа, пока на входе Загрузка 1.

source: Still, as with any automatic formatting, it will not express the structural details that a human-drawn circuit would.
ru_ru: Тем не менее, как и при любом автоматическом форматировании, оно не будет выражать структурных деталей, которые выражают нарисованные человеком схемы.

source: If you type the name of an existing circuit, then that circuit will be replaced (after Logisim prompts you to confirm that you really want to do this).
ru_ru: Если введёте имя существующей схемы, то эта схема будет заменена (после того, как Logisim попросит вас подтвердить, что вы действительно хотите это сделать).

source: Add Circuit...
ru_ru: Добавить схему...

source: As just one comparison, the same circuit and image ran at 714 Hz above with just the speed option but 490 Hz with the table option as well.
ru_ru: В одном из сравнений одна и та же схема и образ выполнились при 714 Гц только с опцией speed, но при 490 Гц с опцией table.

source: The grid can have up to 32 rows and 32 columns.
ru_ru: Сетка может иметь до 32 строк и 32 столбцов.

source: Power/Ground
ru_ru: Питание/Земля

source: Decoder
ru_ru: Декодер

source: With "unchanged," the floating values are sent into the layout as floating values; with "pull up," they are converted into 1 values before being sent into the circuit layout; and with "pull down," they are converted into 0 values before being sent into the circuit layout.
ru_ru: При значении "Не менять" плавающие значения передаются в чертёж как плавающие значения; при значении "Повышать" они преобразуются в 1 до того, как передаются в чертёж схемы; и при значении "Понижать" они преобразуются в 0 до того, как передаются в чертёж схемы.

source: Note that your edited expression will be lost if you edit the truth table.
ru_ru: Обратите внимание, что отредактированные вами выражения будут потеряны, если вы измените таблицу истинности.

source: Controlled Buffer/Inverter
ru_ru: Управляемый буфер/инвертор

source: sel on south edge (input, bit width 1)
ru_ru: sel на южном крае (вход, разрядность равна 1)

source: The circuit can load and store values in RAM. Also, the user can modify individual values interactively via the Poke Tool, or the user can modify the entire contents via the Menu Tool.
ru_ru: Схема может считывать и записывать значения в ОЗУ. Кроме того, пользователь может интерактивно изменять отдельные значения с помощью Инструмента Нажатие, или менять всё содержимое через Инструмент Меню.

source: Each time the clock input (diagrammed with a triangle on the component's south edge) triggers according to its Trigger attribute, the value in the counter may update based on the two inputs on the component's west edge: The upper input is called load and the lower is called count, and they are interpreted as follows.
ru_ru: Каждый раз, когда тактовый вход (отмеченный треугольником на южном крае компонента) срабатывает в соответствии с его атрибутом Срабатывание, значение в счётчике может обновиться на основании значений двух входов на западном крае компонента: верхнего входа, названного загрузка, и нижнего, названного счёт, и они интерпретируются следующим образом.

source: However, the circuit may currently be propagating in
ru_ru: Однако, схема может просчитываться в данный момент в

source: * in Gray Code.
ru_ru: * в коде Грея.

source: Show Ghosts while adding: When checked, and when a tool for adding a new component is selected, a light-gray outline of a component to be added is drawn as the mouse moves across the canvas.
ru_ru: Показывать призраки во время добавления: когда включено, и когда выбран инструмент для добавления нового компонента, при движении мыши по холсту отрисовывается светло-серый контур компонента.

source: Contains classes specifically related to defining components, including the InstanceFactory, InstanceState, InstancePainter, and Instance classes.
ru_ru: Содержит классы, непосредственно связанные с объявлением компонентов, в том числе классы InstanceFactory, InstanceState, InstancePainter, и Instance.

source: Most often, a tool is intended for adding components of a particular type into a circuit; but some of the most important tools, such as the Poke Tool and the Select Tool, allow you to interact with components in other ways.
ru_ru: Чаще всего инструмент предназначен для добавления компонентов того или иного вида в схему, но некоторые из наиболее важных инструментов, такие как Инструмент Нажатие и Инструмент Выбор, позволяют пользователям взаимодействовать с компонентами и другими способами.

source: A value holding all of the bits traveling through the splitter.
ru_ru: Содержит значения всех битов, проходящих через разветвитель.

source: For example, if we have an eight-bit input 01010101, and we are to have a three-bit output, then group 0 will be the lowest-order three bits 101, group 1 will be the next three bits, 010, and group 2 will be the next three bits 001.
ru_ru: Например, если у нас есть 8-битный вход 01010101, и мы должны иметь 3-битный выход, то группа 0 будет тремя битами 101 с самым низким порядком, группа 1 - следующие три бита, 010, и группа 2 - следующие три бита 001.

source: If 1, then 1 is borrowed out of the difference.
ru_ru: Если на этом входе 1, то 1 заимствуется из разности.

source: The bit width of the values to be added and of the result.
ru_ru: Разрядность значений для сложения и результата.

source: Outputs the value at the currently selected address at the D pin if sel is 1 or floating.
ru_ru: Выдаёт значение по выбранному в данный момент адресу на контакт D, если на входе sel 1 или плавающее значение.

source: One approach is to build a test circuit that does the comparison directly.
ru_ru: Один из подходов заключается в создании проверяющей схемы, которая непосредственно выполняет сравнение.

source: Data - this is the ASCII value of the next character to be entered into the terminal.
ru_ru: Данные - ASCII значение следующего символа, вводимого в терминал.
